Development/DDPs/ManageResourceInventory/trunk/IIS/xml/getAllManagedElements.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://www.tmforum.org/mtop/framework/msg/v1" xmlns:m1="http://www.tmforum.org/mtop/nrf/names/v1">  <SOAP-ENV:Header>    <m:header xmlns:m="http://www.tmforum.org/mtop/framework/header/v1">      <m:activityName>String</m:activityName>      <m:msgName>String</m:msgName>      <m:msgType>REQUEST</m:msgType>      <m:senderURI>http://www.altova.com</m:senderURI>      <m:destinationURI>http://www.altova.com</m:destinationURI>      <m:replyToURI>http://www.altova.com</m:replyToURI>      <m:originatorURI>http://www.altova.com</m:originatorURI>      <m:failureReplytoURI>http://www.altova.com</m:failureReplytoURI>      <m:activityStatus qualifier=""/>      <m:correlationId>String</m:correlationId>      <m:security>String</m:security>      <m:securityType>String</m:securityType>      <m:priority>0</m:priority>      <m:msgSpecificProperties>        <m:property>          <m:propName>String</m:propName>          <m:propValue>String</m:propValue>        </m:property>      </m:msgSpecificProperties>      <m:communicationPattern>SimpleResponse</m:communicationPattern>      <m:communicationStyle>MSG</m:communicationStyle>      <m:requestedBatchSize>0</m:requestedBatchSize>      <m:batchSequenceNumber>0</m:batchSequenceNumber>      <m:batchSequenceEndOfReply>true</m:batchSequenceEndOfReply>      <m:iteratorReferenceURI>http://www.altova.com</m:iteratorReferenceURI>      <m:fileLocationURI>http://www.altova.com</m:fileLocationURI>      <m:compressionType>MINOR_a</m:compressionType>      <m:packingType>MINOR_a</m:packingType>      <m:timestamp>String</m:timestamp>      <m:vendorExtensions/>    </m:header>  </SOAP-ENV:Header>  <SOAP-ENV:Body>    <m:getAllManagedElements xmlns:m="http://www.tmforum.org/mtop/mri/me/v1">      <m0:vendorExtensions/>      <m:mdName>        <m1:mdNm>a</m1:mdNm>      </m:mdName>    </m:getAllManagedElements>  </SOAP-ENV:Body></SOAP-ENV:Envelope>